app/controllers/ordem_servicos_controller.rb

SELECT "ordem_servicos".* FROM "ordem_servicos"
---
  def index
    if params[:type_search].present? and params[:find_by].present?
      type_search  = params[:type_search]
      num          = params[:find_by].gsub(/[^0-9]/,'').to_i
      cond = case type_search
        when '2' then { id: num }
        when '1' then "numero like '#{num}'"
        else { id: 0 }
      end
      @ordem_servicos = OrdemServico.includes(:servicos, :cliente).where(cond).order(created_at: :desc).paginate(page: params[:page])
      flash[:error] = t(:not_found, name: "Ordem de Serviços") if @ordem_servicos.blank?