app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"  LIMIT 30 OFFSET 0
---
  def index
    @produtos = Produto.all.paginate(page: params[:page])