app/controllers/servicos_controller.rb

SELECT  "servicos".* FROM "servicos"  LIMIT 30 OFFSET 0
---
  def index
    @servicos = Servico.all.paginate(page: params[:page])

INSERT INTO "servicos" ("created_at", "descricao", "percentual", "updated_at", "valor") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-19 19:33:04.724095"], ["descricao", "Serviço"], ["percentual", 5.0], ["updated_at", "2015-05-19 19:33:04.724095"], ["valor", 5.0]]
---
  def create
    @servico = Servico.new(servico_params)

    respond_to do |format|
      if @servico.save

SELECT  "servicos".* FROM "servicos"  WHERE "servicos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_servico
      @servico = Servico.find(params[:id])